#+title: Emacs Lisp

[[file:../../../../homepage.org][Homepage]] / [[file:../../../../notes.org][Notes]] / [[file:../../../computer-science.org][Computer Science]] / [[file:../../languages.org][Programming Languages]] / [[file:../niche-languages.org][Niche Languages]] / Emacs Lisp

* Basics
#+begin_src elisp
(princ "Hello, World!")
#+end_src

#+RESULTS:
: Hello, World!

#+begin_src elisp
(+ 2 2)
#+end_src

#+RESULTS:
: 4

#+begin_src elisp
(setq name "Damien")
#+end_src

#+RESULTS:
: Damien

* HTTP Request
** Using =url-retrieve-synchronously=
#+begin_src elisp
(defun http-get (url)
  "Make a HTTP GET request to URL and return the response body as a string."
  (with-current-buffer (url-retrieve-synchronously url)
    (goto-char (point-min))
    (re-search-forward "^$" nil 'move)
    (while (looking-at-p "\n")
      (forward-char 1))
    (buffer-substring-no-properties (point) (point-max))))

(http-get "https://httpbin.org/get")
#+end_src

#+RESULTS:
#+begin_example
{
  "args": {},
  "headers": {
    "Accept": "*/*",
    "Accept-Encoding": "gzip",
    "Extension": "Security/Digest Security/SSL",
    "Host": "httpbin.org",
    "Mime-Version": "1.0",
    "User-Agent": "URL/Emacs Emacs/28.2 (OpenStep; aarch64-apple-darwin21.6.0)",
    "X-Amzn-Trace-Id": "Root=1-64452ce7-2e5e19c67e996e6809c55d74"
  },
  "origin": "70.81.232.143",
  "url": "https://httpbin.org/get"
}
#+end_example
